experiments/2026-08-18-qwen-qwen3-8b-v1-5fa1f7e/nano-vllm__ragged-sla.log
INFO 08-18 17:41:14 [importing.py:53] Triton is installed but 0 active driver(s) found (expected 1). Disabling Triton to prevent runtime errors.
INFO 08-18 17:41:14 [importing.py:88] Triton not installed or not compatible; certain GPU-related functions will not be available.
INFO 08-18 17:41:16 [main.py:71] Unspecified platform detected, switching to CPU Platform instead.
WARNING 08-18 17:41:16 [cpu.py:440] Failed to import from vllm._C: ModuleNotFoundError("No module named 'vllm._C'")
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x791587df87c0>, trust_remote_code=False, seed=0, num_prompts=100, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=512, random_output_len=512, random_range_ratio='0.75', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url='http://nano-vllm:8001', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=None, model='Qwen/Qwen3-8B', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=4.0, burstiness=1.0, probe_request_rate=0.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/results', result_filename='nano-vllm__ragged-sla.json', ignore_eos=False, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='99', goodput=['ttft:2000', 'tpot:50'], request_id_prefix='bench-b70bdec8-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 08-18 17:41:19 [utils.py:90] Sampling input_len from [128, 896] and output_len from [128, 896]
WARNING: /tokenize unavailable, skipping alignment.
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 4.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     100       
Failed requests:                         0         
Request rate configured (RPS):           4.00      
Benchmark duration (s):                  762.60    
Total input tokens:                      51917     
Total generated tokens:                  48921     
Request throughput (req/s):              0.13      
Request goodput (req/s):                 0.00      
Output token throughput (tok/s):         64.15     
Peak output token throughput (tok/s):    73.00     
Peak concurrent requests:                98.00     
Total token throughput (tok/s):          132.23    
---------------Time to First Token----------------
Mean TTFT (ms):                          319254.52 
Median TTFT (ms):                        322336.40 
P99 TTFT (ms):                           672883.94 
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          330.73    
Median TPOT (ms):                        121.90    
P99 TPOT (ms):                           684.70    
---------------Inter-token Latency----------------
Mean ITL (ms):                           124.12    
Median ITL (ms):                         120.75    
P99 ITL (ms):                            242.11    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          378493.83 
Median E2EL (ms):                        383174.34 
P99 E2EL (ms):                           737601.29 
==================================================

--- stderr ---
W0818 17:41:14.723000 1 torch/utils/cpp_extension.py:178] No CUDA runtime is found, using CUDA_HOME='/usr/local/cuda'
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.

  0%|          | 0/100 [00:00<?, ?it/s]
  1%|          | 1/100 [00:22<37:30, 22.74s/it]
  2%|▏         | 2/100 [00:23<15:59,  9.79s/it]
  3%|▎         | 3/100 [00:38<19:45, 12.22s/it]
  4%|▍         | 4/100 [00:45<16:05, 10.06s/it]
  5%|▌         | 5/100 [00:51<13:52,  8.76s/it]
  6%|▌         | 6/100 [01:09<18:44, 11.97s/it]
  7%|▋         | 7/100 [01:14<14:52,  9.60s/it]
  8%|▊         | 8/100 [01:28<16:54, 11.02s/it]
  9%|▉         | 9/100 [01:30<12:12,  8.05s/it]
 10%|█         | 10/100 [01:33<09:38,  6.43s/it]
 11%|█         | 11/100 [01:38<09:08,  6.17s/it]
 12%|█▏        | 12/100 [01:40<07:12,  4.92s/it]
 13%|█▎        | 13/100 [01:47<08:01,  5.54s/it]
 14%|█▍        | 14/100 [02:01<11:18,  7.89s/it]
 15%|█▌        | 15/100 [02:07<10:38,  7.51s/it]
 16%|█▌        | 16/100 [02:10<08:23,  6.00s/it]
 17%|█▋        | 17/100 [02:27<13:03,  9.44s/it]
 18%|█▊        | 18/100 [02:44<15:53, 11.63s/it]
 19%|█▉        | 19/100 [02:51<13:42, 10.15s/it]
 20%|██        | 20/100 [02:51<09:49,  7.37s/it]
 21%|██        | 21/100 [02:54<07:52,  5.98s/it]
 22%|██▏       | 22/100 [02:56<06:13,  4.79s/it]
 23%|██▎       | 23/100 [02:58<05:12,  4.06s/it]
 24%|██▍       | 24/100 [03:04<05:42,  4.51s/it]
 25%|██▌       | 25/100 [03:06<04:31,  3.62s/it]
 26%|██▌       | 26/100 [03:08<03:58,  3.22s/it]
 27%|██▋       | 27/100 [03:12<04:03,  3.34s/it]
 28%|██▊       | 28/100 [03:42<13:51, 11.55s/it]
 29%|██▉       | 29/100 [03:46<10:55,  9.23s/it]
 30%|███       | 30/100 [03:56<11:10,  9.57s/it]
 31%|███       | 31/100 [04:05<10:37,  9.24s/it]
 32%|███▏      | 32/100 [04:06<07:50,  6.91s/it]
 33%|███▎      | 33/100 [04:07<05:27,  4.88s/it]
 34%|███▍      | 34/100 [04:23<09:15,  8.41s/it]
 35%|███▌      | 35/100 [04:32<09:23,  8.66s/it]
 36%|███▌      | 36/100 [04:39<08:32,  8.01s/it]
 37%|███▋      | 37/100 [04:39<06:02,  5.76s/it]
 38%|███▊      | 38/100 [04:45<06:00,  5.81s/it]
 39%|███▉      | 39/100 [04:47<04:35,  4.52s/it]
 40%|████      | 40/100 [05:10<10:13, 10.23s/it]
 41%|████      | 41/100 [05:21<10:06, 10.28s/it]
 42%|████▏     | 42/100 [05:34<10:42, 11.07s/it]
 43%|████▎     | 43/100 [05:38<08:39,  9.12s/it]
 44%|████▍     | 44/100 [05:43<07:11,  7.70s/it]
 45%|████▌     | 45/100 [05:47<06:12,  6.77s/it]
 46%|████▌     | 46/100 [05:55<06:19,  7.03s/it]
 47%|████▋     | 47/100 [05:58<05:17,  5.99s/it]
 48%|████▊     | 48/100 [06:00<04:01,  4.64s/it]
 49%|████▉     | 49/100 [06:22<08:19,  9.79s/it]
 50%|█████     | 50/100 [06:36<09:18, 11.17s/it]
 51%|█████     | 51/100 [06:38<06:50,  8.37s/it]
 52%|█████▏    | 52/100 [06:47<06:45,  8.45s/it]
 53%|█████▎    | 53/100 [06:55<06:36,  8.44s/it]
 54%|█████▍    | 54/100 [06:55<04:38,  6.05s/it]
 55%|█████▌    | 55/100 [06:56<03:16,  4.36s/it]
 56%|█████▌    | 56/100 [07:09<05:01,  6.86s/it]
 57%|█████▋    | 57/100 [07:31<08:21, 11.67s/it]
 58%|█████▊    | 58/100 [07:34<06:16,  8.95s/it]
 59%|█████▉    | 59/100 [07:46<06:37,  9.70s/it]
 60%|██████    | 60/100 [07:49<05:12,  7.82s/it]
 61%|██████    | 61/100 [07:50<03:44,  5.75s/it]
 62%|██████▏   | 62/100 [08:11<06:33, 10.35s/it]
 63%|██████▎   | 63/100 [08:11<04:31,  7.33s/it]
 64%|██████▍   | 64/100 [08:13<03:20,  5.57s/it]
 65%|██████▌   | 65/100 [08:21<03:42,  6.36s/it]
 66%|██████▌   | 66/100 [08:22<02:45,  4.86s/it]
 67%|██████▋   | 67/100 [08:23<01:57,  3.56s/it]
 68%|██████▊   | 68/100 [08:39<03:57,  7.41s/it]
 69%|██████▉   | 69/100 [08:53<04:48,  9.32s/it]
 70%|███████   | 70/100 [08:55<03:36,  7.21s/it]
 71%|███████   | 71/100 [08:56<02:29,  5.15s/it]
 72%|███████▏  | 72/100 [09:05<03:01,  6.48s/it]
 73%|███████▎  | 73/100 [09:06<02:09,  4.80s/it]
 74%|███████▍  | 74/100 [09:23<03:43,  8.58s/it]
 75%|███████▌  | 75/100 [09:26<02:47,  6.71s/it]
 76%|███████▌  | 76/100 [09:37<03:12,  8.03s/it]
 77%|███████▋  | 77/100 [09:44<03:00,  7.85s/it]
 78%|███████▊  | 78/100 [09:47<02:16,  6.21s/it]
 79%|███████▉  | 79/100 [10:04<03:17,  9.39s/it]
 80%|████████  | 80/100 [10:22<04:01, 12.05s/it]
 81%|████████  | 81/100 [10:29<03:19, 10.50s/it]
 82%|████████▏ | 82/100 [10:30<02:19,  7.73s/it]
 83%|████████▎ | 83/100 [10:44<02:41,  9.50s/it]
 84%|████████▍ | 84/100 [10:52<02:26,  9.16s/it]
 85%|████████▌ | 85/100 [10:52<01:37,  6.50s/it]
 86%|████████▌ | 86/100 [11:06<01:59,  8.55s/it]
 87%|████████▋ | 87/100 [11:21<02:18, 10.68s/it]
 88%|████████▊ | 88/100 [11:23<01:35,  7.97s/it]
 89%|████████▉ | 89/100 [11:35<01:40,  9.13s/it]
 90%|█████████ | 90/100 [11:35<01:05,  6.54s/it]
 91%|█████████ | 91/100 [11:37<00:46,  5.17s/it]
 92%|█████████▏| 92/100 [11:42<00:39,  4.97s/it]
 93%|█████████▎| 93/100 [11:58<00:59,  8.51s/it]
 94%|█████████▍| 94/100 [12:15<01:05, 10.97s/it]
 95%|█████████▌| 95/100 [12:16<00:39,  7.85s/it]
 96%|█████████▌| 96/100 [12:21<00:28,  7.02s/it]
 97%|█████████▋| 97/100 [12:23<00:16,  5.63s/it]
 98%|█████████▊| 98/100 [12:28<00:10,  5.23s/it]
 99%|█████████▉| 99/100 [12:42<00:08,  8.02s/it]
100%|██████████| 100/100 [12:42<00:00,  7.63s/it]